# Fri Jul 28 15:11:32 PDT 2023

tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
brew "autoconf"
brew "automake"
brew "aws-iam-authenticator"
brew "openssl@3"
brew "awscli"
brew "bash"
brew "clang-format"
brew "coreutils"
brew "exa"
brew "ffmpeg"
brew "fish"
brew "git-extras"
brew "libksba"
brew "gnupg"
brew "grep"
brew "libtool"
brew "pkg-config"
brew "htop"
brew "httpie"
brew "hugo"
brew "jq"
brew "lazygit"
brew "libyaml"
brew "nvm"
brew "peco"
brew "protobuf"
brew "python@3.10"
brew "rbenv"
brew "redis", restart_service: true
brew "ripgrep"
brew "shellcheck"
brew "tfenv"
brew "wget"
brew "yt-dlp"
brew "zlib"
brew "zsh"
brew "zsh-completions"
cask "arc"
cask "caffeine"
cask "contexts"
cask "discord"
cask "divvy"
cask "font-go-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "insomnia"
cask "iterm2"
cask "itsycal"
cask "marta"
cask "slack-beta"
cask "soulver"
cask "telegram"
cask "visual-studio-code"
cask "vlc"
vscode "amzn.vscode-crux"
vscode "andyyaldoo.vscode-json"
vscode "asvetliakov.snapshot-tools"
vscode "aws-scripting-guy.cform"
vscode "bierner.markdown-preview-github-styles"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "golang.go"
vscode "GrapeCity.gc-excelviewer"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-syntax"
vscode "humao.rest-client"
vscode "kumar-harsh.graphql-for-vscode"
vscode "marklel.vscode-brazil"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "noahm.codeowners-extended"
vscode "oliversturm.fix-json"
vscode "quicktype.quicktype"
vscode "rebornix.ruby"
vscode "redhat.vscode-yaml"
vscode "skyapps.fish-vscode"
vscode "stkb.rewrap"
vscode "stylelint.vscode-stylelint"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "ue.alphabetical-sorter"
vscode "vscode-icons-team.vscode-icons"
vscode "wingrunr21.vscode-ruby"
vscode "wix.vscode-import-cost"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"