# Fri May  9 10:48:59 PDT 2025

tap "discoteq/discoteq"
brew "openssl@3"
brew "autoconf"
brew "automake"
brew "aws-iam-authenticator"
brew "awscli"
brew "bash"
brew "glib"
brew "clang-format"
brew "coreutils"
brew "direnv"
brew "docker"
brew "docker-buildx"
brew "exiftool"
brew "harfbuzz"
brew "libass"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fish"
brew "libtool"
brew "git-extras"
brew "libksba"
brew "gnupg"
brew "go"
brew "grep"
brew "htop"
brew "httpie"
brew "hugo"
brew "jq"
brew "lazygit"
brew "libyaml"
brew "nvm"
brew "peco"
brew "php"
brew "pkgconf"
brew "protobuf"
brew "python@3.10"
brew "rbenv"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "shellcheck"
brew "tfenv"
brew "wget"
brew "yt-dlp"
brew "zlib"
brew "zsh"
brew "zsh-completions"
cask "1password"
cask "1password-cli"
cask "caffeine"
cask "contexts"
cask "cursor"
cask "discord"
cask "divvy"
cask "font-go-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "ghostty"
cask "httpie"
cask "itsycal"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "marta"
cask "proton-mail"
cask "raycast"
cask "rocket"
cask "slack@beta"
cask "soulver"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
vscode "andyyaldoo.vscode-json"
vscode "asvetliakov.snapshot-tools"
vscode "aykutsarac.jsoncrack-vscode"
vscode "bierner.markdown-preview-github-styles"
vscode "cduruk.thrift"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "kumar-harsh.graphql-for-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "noahm.codeowners-extended"
vscode "oliversturm.fix-json"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "skyapps.fish-vscode"
vscode "stkb.rewrap"
vscode "stylelint.vscode-stylelint"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "tyriar.sort-lines"
vscode "ue.alphabetical-sorter"
vscode "vscode-icons-team.vscode-icons"
vscode "wix.vscode-import-cost"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"