# Thu Oct 10 11:02:42 PDT 2024

tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
brew "autoconf"
brew "automake"
brew "aws-iam-authenticator"
brew "openssl@3"
brew "awscli"
brew "bash"
brew "python@3.12"
brew "clang-format"
brew "coreutils"
brew "docker"
brew "docker-buildx"
brew "ffmpeg"
brew "fish"
brew "git-extras"
brew "libksba"
brew "gnupg"
brew "grep"
brew "htop"
brew "httpie", link: false
brew "hugo"
brew "jq"
brew "lazygit"
brew "libtool"
brew "libyaml"
brew "nvm"
brew "peco"
brew "pkg-config"
brew "protobuf"
brew "python@3.10"
brew "rbenv"
brew "redis", restart_service: true
brew "ripgrep"
brew "shellcheck"
brew "tfenv"
brew "wget"
brew "yt-dlp"
brew "zlib"
brew "zsh"
brew "zsh-completions"
cask "1password-cli"
cask "alfred"
cask "arc"
cask "caffeine"
cask "charles"
cask "contexts"
cask "discord"
cask "divvy"
cask "font-go-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "httpie"
cask "insomnia"
cask "iterm2"
cask "itsycal"
cask "jetbrains-toolbox"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "kindle"
cask "marta"
cask "rocket"
cask "soulver"
cask "spotify"
cask "telegram"
cask "visual-studio-code"
cask "vlc"
vscode "andyyaldoo.vscode-json"
vscode "asvetliakov.snapshot-tools"
vscode "aykutsarac.jsoncrack-vscode"
vscode "bierner.markdown-preview-github-styles"
vscode "byted-sec.bytesec-vscode"
vscode "cduruk.thrift"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "humao.rest-client"
vscode "ktiays.aicursor"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "oliversturm.fix-json"
vscode "quicktype.quicktype"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "skyapps.fish-vscode"
vscode "stkb.rewrap"
vscode "stylelint.vscode-stylelint"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "tyriar.sort-lines"
vscode "ue.alphabetical-sorter"
vscode "vscode-icons-team.vscode-icons"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"